Revit 2024 API
PipeFittingAndAccessoryConnectorData.Index Property
 Return the index of this connector
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int Index { get; }
Visual Basic
Public ReadOnly Property Index As Integer
	Get
Visual C++
public:
property int Index {
	int get ();
}
See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace